Authorization/ls-7/UserApp/app/controllers/lab_reports_controller.rb

    def index
        @lab_reports = LabReport.all
---
SELECT "lab_reports".* FROM "lab_reports"

      def show
        @lab_report = LabReport.find(params[:id])
---
SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

      def new
        @lab_report = LabReport.new
        @users = User.all # Загружаем всех пользователей для выбора
---
SELECT "users".* FROM "users"

      def create
        @lab_report = LabReport.new(lab_report_params)
        if @lab_report.save
---
INSERT INTO "lab_reports" ("title", "description", "grade", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "qweqweq"], ["description", "qweqwe"], ["grade", "FX"], ["created_at", "2024-07-31 20:38:12.457717"], ["updated_at", "2024-07-31 20:38:12.457717"], ["user_id", 1]]